#+TITLE: Helpful Emacs Shortcuts
#+AUTHOR: Yazan Alrayyes
#+SUBTITLE: Shortcuts to know for using Emacs 
#+Startup: showeverything
#+OPTIONS: H:5 toc:2 num:t
#+EXPORT_FILE_NAME: Emacs Shortcuts
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
@@latex:\clearpage@@ 

** Evaluating Code Blocks/Outputting Results
You can add keyword ":results value/output" after codeblock #+begin_src LANGUAGE tage in order for it to evaluate and output the code in your org document.
You can use either "value" or "output". See [[https://orgmode.org/manual/Results-of-Evaluation.html]]

(M-r) can be used inside code block to evaluate code (get result). It's just a keybinding I made for (C-c C-c).

NOTE: Ensure you download the language from Org Babel (check config file) if it's not evaluating.

+NOTE 2: Python needs you to add  ":python python3" in order to work. This specifies the name of the command for executing Python code, which on your computer is python3.+
^Dismiss this. I fixed it in the config file by setting python3 to be default execution command. Use python like any other code block.

Example 1:

#+begin_src emacs-lisp :results value
(message "hi emacs")
(message "hi again")
;tesing comments/keybinding
#+end_src

#+RESULTS:
: hi again

Example 2:
# use return statement
# Entire source block will get indented and used as the body of main()
#+begin_src python
def foo(x):
  if x>0:
    return x+1

  else:
    return 17

return foo(0)
#+end_src

#+RESULTS:
: 17

Example 3:

#+begin_src C++ :includes <stdio.h>
int a=1;
int b=1;
printf("%d\n", a+b);
#+end_src

#+RESULTS:
: 2

